In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Data Analysis

### Analysing Meal Information

In [2]:
meal_info = pd.read_csv("../data/train/meal_info.csv")
meal_info.head()

   meal_id   category cuisine
0     1885  Beverages    Thai
1     1993  Beverages    Thai
2     2539  Beverages    Thai
3     1248  Beverages  Indian
4     2631  Beverages  Indian

Let's check the summary of meal information

In [3]:
meal_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 3 columns):
meal_id     51 non-null int64
category    51 non-null object
cuisine     51 non-null object
dtypes: int64(1), object(2)
memory usage: 1.3+ KB

Let's check the values in category and cuisine columns

In [4]:
meal_info.category.value_counts()

Beverages       12
Desert           3
Fish             3
Sandwich         3
Biryani          3
Rice Bowl        3
Soup             3
Seafood          3
Starters         3
Extras           3
Pizza            3
Pasta            3
Salad            3
Other Snacks     3
Name: category, dtype: int64

In [5]:
meal_info.cuisine.value_counts()

Thai           15
Continental    12
Italian        12
Indian         12
Name: cuisine, dtype: int64

<b>There is nothing to clean in meal information</b>

### Analysing Fulfilment Center Information

In [6]:
fulfilment_center_info = pd.read_csv("../data/train/fulfilment_center_info.csv")
fulfilment_center_info.head()

   center_id  city_code  region_code center_type  op_area
0         11        679           56      TYPE_A      3.7
1         13        590           56      TYPE_B      6.7
2        124        590           56      TYPE_C      4.0
3         66        648           34      TYPE_A      4.1
4         94        632           34      TYPE_C      3.6

Let's check the summary of fulfilment center information

In [7]:
fulfilment_center_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 5 columns):
center_id      77 non-null int64
city_code      77 non-null int64
region_code    77 non-null int64
center_type    77 non-null object
op_area        77 non-null float64
dtypes: float64(1), int64(3), object(1)
memory usage: 3.1+ KB

Let's check the values in city_code, region_code and center_type columns

In [8]:
fulfilment_center_info.city_code.value_counts()

590    9
526    8
638    3
593    2
517    2
647    2
522    2
676    2
576    2
699    2
604    2
614    2
602    1
541    1
556    1
683    1
553    1
680    1
679    1
485    1
675    1
658    1
659    1
654    1
651    1
615    1
649    1
648    1
620    1
628    1
685    1
561    1
473    1
577    1
599    1
596    1
478    1
461    1
713    1
456    1
579    1
609    1
562    1
703    1
702    1
700    1
632    1
698    1
695    1
693    1
515    1
Name: city_code, dtype: int64

In [9]:
fulfilment_center_info.region_code.value_counts()

56    30
34    21
77    17
85     5
93     1
71     1
35     1
23     1
Name: region_code, dtype: int64

In [10]:
fulfilment_center_info.center_type.value_counts()

TYPE_A    43
TYPE_C    19
TYPE_B    15
Name: center_type, dtype: int64

Let's check the values in op_area column

In [11]:
fulfilment_center_info.op_area.describe()

count    77.000000
mean      3.985714
std       1.106406
min       0.900000
25%       3.500000
50%       3.900000
75%       4.400000
max       7.000000
Name: op_area, dtype: float64

<b>There is nothing to clean in fulfilment center information</b>

### Analysing training data

In [12]:
training_data = pd.read_csv("../data/train/train.csv")
training_data.head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders
0,1379560,1,55,1885,136.83,152.29,0,0,177
1,1466964,1,55,1993,136.83,135.83,0,0,270
2,1346989,1,55,2539,134.86,135.86,0,0,189
3,1338232,1,55,2139,339.50,437.53,0,0,54
4,1448490,1,55,2631,243.50,242.50,0,0,40

Let's check the summary of training data

In [13]:
training_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 456548 entries, 0 to 456547
Data columns (total 9 columns):
id                       456548 non-null int64
week                     456548 non-null int64
center_id                456548 non-null int64
meal_id                  456548 non-null int64
checkout_price           456548 non-null float64
base_price               456548 non-null float64
emailer_for_promotion    456548 non-null int64
homepage_featured        456548 non-null int64
num_orders               456548 non-null int64
dtypes: float64(2), int64(7)
memory usage: 31.3 MB

Let's check the values in week column

In [14]:
training_data.week.value_counts()

122    3359
105    3348
106    3347
140    3332
123    3331
       ...
13     2838
12     2831
14     2830
7      2795
8      2786
Name: week, Length: 145, dtype: int64

Training data have unequal observations for weeks. That means, data has missing observations for many weeks.

Let's check the values in center_id and meal_id columns

In [15]:
training_data.center_id.value_counts()

13     7046
10     7015
52     6993
43     6970
67     6915
       ...
139    4627
57     4501
162    4366
41     4083
91     3432
Name: center_id, Length: 77, dtype: int64

In [16]:
training_data.meal_id.value_counts()

2290    11138
1062    11137
1727    11136
1109    11134
1754    11132
2707    11123
1778    11121
1993    11116
1962    11114
1971    11102
1885    11092
2581    11072
2826    11057
2322    11002
1558    10952
1207    10806
2640    10747
1230    10746
1878    10527
2631    10458
2539    10451
1543    10236
2760    10209
1248     9939
2664     9853
2704     9811
1445     9727
2126     9705
1216     9695
2304     9676
2569     9459
2492     9382
1525     9359
2490     9247
2444     9097
2139     8899
2577     8667
2306     8294
2867     8092
1247     7184
1902     6748
1770     6682
1311     4682
1803     4674
1571     4511
1438     4385
2494     4206
1198     4206
1847     4084
2956     3319
2104     2357
Name: meal_id, dtype: int64

Let's check the values in checkout_price and base_price columns

In [17]:
training_data.checkout_price.describe()

count    456548.000000
mean        332.238933
std         152.939723
min           2.970000
25%         228.950000
50%         296.820000
75%         445.230000
max         866.270000
Name: checkout_price, dtype: float64

In [18]:
training_data.base_price.describe()

count    456548.000000
mean        354.156627
std         160.715914
min          55.350000
25%         243.500000
50%         310.460000
75%         458.870000
max         866.270000
Name: base_price, dtype: float64

There is lots of difference in 25% and minimum value in checkout price. Let's go into details.

In [19]:
training_data.sort_values('checkout_price').head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders
110286,1300283,38,73,1230,2.97,316.25,0,0,14
44875,1381921,16,41,1248,45.62,253.23,0,0,123
44874,1414392,16,41,2631,47.59,253.23,0,0,163
417180,1372230,134,24,2631,53.41,86.39,1,0,134
72701,1324508,26,124,1803,55.35,212.43,0,0,81

There is an outlier with checkout_price as 2.97.

Let's check the values in num_orders column

In [20]:
training_data.num_orders.describe()

count    456548.000000
mean        261.872760
std         395.922798
min          13.000000
25%          54.000000
50%         136.000000
75%         324.000000
max       24299.000000
Name: num_orders, dtype: float64

There is lots of difference in 75% and maximum value. Let's go into details.

In [21]:
training_data.sort_values('num_orders').tail()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,num_orders
413351,1346216,132,43,1971,204.70,324.04,1,1,13150
13923,1470267,5,10,2290,162.99,309.43,1,0,13580
16904,1087163,6,43,2290,156.20,310.43,0,1,14229
19700,1300512,7,43,2290,159.08,311.43,1,1,15336
14050,1452474,5,43,2290,159.08,311.43,1,1,24299

Another outlier is present with 24299 number of orders.

Let's check the values in emailer_for_promotion and homepage_featured columns

In [22]:
training_data.emailer_for_promotion.value_counts()

0    419498
1     37050
Name: emailer_for_promotion, dtype: int64

In [23]:
training_data.homepage_featured.value_counts()

0    406693
1     49855
Name: homepage_featured, dtype: int64

<b>Data analysing summary of training data</b>
1. There are many missing observations for some weeks
2. There is an outlier with checkout_price as 2.97
3. Another outlier is present with 24299 number of orders

### Analysing test data

In [24]:
test_data = pd.read_csv("../data/test/test.csv")
test_data.head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured
0,1028232,146,55,1885,158.11,159.11,0,0
1,1127204,146,55,1993,160.11,159.11,0,0
2,1212707,146,55,2539,157.14,159.14,0,0
3,1082698,146,55,2631,162.02,162.02,0,0
4,1400926,146,55,1248,163.93,163.93,0,0

Let's check the summary of test data

In [25]:
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32573 entries, 0 to 32572
Data columns (total 8 columns):
id                       32573 non-null int64
week                     32573 non-null int64
center_id                32573 non-null int64
meal_id                  32573 non-null int64
checkout_price           32573 non-null float64
base_price               32573 non-null float64
emailer_for_promotion    32573 non-null int64
homepage_featured        32573 non-null int64
dtypes: float64(2), int64(6)
memory usage: 2.0 MB

Let's check the values in week column

In [26]:
test_data.week.value_counts()

148    3332
149    3313
150    3277
147    3271
153    3268
152    3242
146    3240
154    3228
151    3224
155    3178
Name: week, dtype: int64

Test data too have missing observations for weeks.

Let's check the values in center_id and meal_id column

In [27]:
test_data.meal_id.value_counts()

1727    770
2826    770
2290    770
2664    770
1754    770
1962    770
2569    770
2581    769
1885    769
1109    769
2490    769
1971    768
1558    767
1993    767
1062    766
2707    764
1778    762
2539    761
1543    760
1207    758
2322    752
1230    744
2640    735
2704    724
2631    717
2304    715
2760    712
1216    709
1878    709
2139    671
1525    668
1248    660
2492    638
2126    626
1445    602
2306    592
2444    568
1571    544
2577    540
2867    527
1770    486
1902    435
2956    426
1247    416
2104    361
1311    342
1803    341
1847    333
1438    327
1198    309
2494    305
Name: meal_id, dtype: int64

In [28]:
test_data.center_id.value_counts()

13     509
10     508
52     506
174    504
43     499
      ...
139    321
57     311
162    310
41     299
91     280
Name: center_id, Length: 77, dtype: int64

Let's check the values in checkout_price and base_price columns

In [29]:
test_data.checkout_price.describe()

count    32573.000000
mean       341.854440
std        153.893886
min         67.900000
25%        214.430000
50%        320.130000
75%        446.230000
max       1113.620000
Name: checkout_price, dtype: float64

In [30]:
test_data.base_price.describe()

count    32573.000000
mean       356.493615
std        155.150101
min         89.240000
25%        243.500000
50%        321.130000
75%        455.930000
max       1112.620000
Name: base_price, dtype: float64

Let's check the values in emailer_for_promotion and homepage_featured columns

In [31]:
test_data.emailer_for_promotion.value_counts()

0    30409
1     2164
Name: emailer_for_promotion, dtype: int64

In [32]:
test_data.homepage_featured.value_counts()

0    29923
1     2650
Name: homepage_featured, dtype: int64

<b>Test data also contains missing observation for weeks</b>

 <br><br><br>

# Merging dataset

Combining train and test data for pre-processing

In [33]:
training_data_without_target = training_data[training_data.columns[training_data.columns != 'num_orders'].values]
total_data = training_data_without_target.append(test_data, sort=False)
total_data.tail()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured
32568,1250239,155,61,1543,482.09,484.09,0,0
32569,1039516,155,61,2304,483.09,483.09,0,0
32570,1158107,155,61,2664,322.07,323.07,0,0
32571,1444235,155,61,2569,322.07,323.07,0,0
32572,1291286,155,61,2490,276.45,276.45,0,0

Let's merge fulfilment center information into total data

In [34]:
total_data_with_center = total_data.merge(fulfilment_center_info, on='center_id', how='left')
total_data_with_center.head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,city_code,region_code,center_type,op_area
0,1379560,1,55,1885,136.83,152.29,0,0,647,56,TYPE_C,2.0
1,1466964,1,55,1993,136.83,135.83,0,0,647,56,TYPE_C,2.0
2,1346989,1,55,2539,134.86,135.86,0,0,647,56,TYPE_C,2.0
3,1338232,1,55,2139,339.50,437.53,0,0,647,56,TYPE_C,2.0
4,1448490,1,55,2631,243.50,242.50,0,0,647,56,TYPE_C,2.0

Let's merge meal information into total data

In [35]:
total_data_with_center_meal = total_data_with_center.merge(meal_info, on='meal_id', how='left')
total_data_with_center_meal.head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,city_code,region_code,center_type,op_area,category,cuisine
0,1379560,1,55,1885,136.83,152.29,0,0,647,56,TYPE_C,2.0,Beverages,Thai
1,1466964,1,55,1993,136.83,135.83,0,0,647,56,TYPE_C,2.0,Beverages,Thai
2,1346989,1,55,2539,134.86,135.86,0,0,647,56,TYPE_C,2.0,Beverages,Thai
3,1338232,1,55,2139,339.50,437.53,0,0,647,56,TYPE_C,2.0,Beverages,Indian
4,1448490,1,55,2631,243.50,242.50,0,0,647,56,TYPE_C,2.0,Beverages,Indian

In [36]:
total_data_with_center_meal.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 489121 entries, 0 to 489120
Data columns (total 14 columns):
id                       489121 non-null int64
week                     489121 non-null int64
center_id                489121 non-null int64
meal_id                  489121 non-null int64
checkout_price           489121 non-null float64
base_price               489121 non-null float64
emailer_for_promotion    489121 non-null int64
homepage_featured        489121 non-null int64
city_code                489121 non-null int64
region_code              489121 non-null int64
center_type              489121 non-null object
op_area                  489121 non-null float64
category                 489121 non-null object
cuisine                  489121 non-null object
dtypes: float64(3), int64(8), object(3)
memory usage: 56.0+ MB

#### Splitting total data into train and test

In [37]:
training_data = training_data[['id', 'num_orders']].merge(total_data_with_center_meal, on='id', how='left')
training_data.head()

,id,num_orders,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,city_code,region_code,center_type,op_area,category,cuisine
0,1379560,177,1,55,1885,136.83,152.29,0,0,647,56,TYPE_C,2.0,Beverages,Thai
1,1466964,270,1,55,1993,136.83,135.83,0,0,647,56,TYPE_C,2.0,Beverages,Thai
2,1346989,189,1,55,2539,134.86,135.86,0,0,647,56,TYPE_C,2.0,Beverages,Thai
3,1338232,54,1,55,2139,339.50,437.53,0,0,647,56,TYPE_C,2.0,Beverages,Indian
4,1448490,40,1,55,2631,243.50,242.50,0,0,647,56,TYPE_C,2.0,Beverages,Indian

In [38]:
training_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 456548 entries, 0 to 456547
Data columns (total 15 columns):
id                       456548 non-null int64
num_orders               456548 non-null int64
week                     456548 non-null int64
center_id                456548 non-null int64
meal_id                  456548 non-null int64
checkout_price           456548 non-null float64
base_price               456548 non-null float64
emailer_for_promotion    456548 non-null int64
homepage_featured        456548 non-null int64
city_code                456548 non-null int64
region_code              456548 non-null int64
center_type              456548 non-null object
op_area                  456548 non-null float64
category                 456548 non-null object
cuisine                  456548 non-null object
dtypes: float64(3), int64(9), object(3)
memory usage: 55.7+ MB

In [39]:
training_data.to_csv('../data/train/train_feature.csv')

In [40]:
test_data = test_data[['id']].merge(total_data_with_center_meal, on='id', how='left')
test_data.head()

,id,week,center_id,meal_id,checkout_price,base_price,emailer_for_promotion,homepage_featured,city_code,region_code,center_type,op_area,category,cuisine
0,1028232,146,55,1885,158.11,159.11,0,0,647,56,TYPE_C,2.0,Beverages,Thai
1,1127204,146,55,1993,160.11,159.11,0,0,647,56,TYPE_C,2.0,Beverages,Thai
2,1212707,146,55,2539,157.14,159.14,0,0,647,56,TYPE_C,2.0,Beverages,Thai
3,1082698,146,55,2631,162.02,162.02,0,0,647,56,TYPE_C,2.0,Beverages,Indian
4,1400926,146,55,1248,163.93,163.93,0,0,647,56,TYPE_C,2.0,Beverages,Indian

In [41]:
test_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32573 entries, 0 to 32572
Data columns (total 14 columns):
id                       32573 non-null int64
week                     32573 non-null int64
center_id                32573 non-null int64
meal_id                  32573 non-null int64
checkout_price           32573 non-null float64
base_price               32573 non-null float64
emailer_for_promotion    32573 non-null int64
homepage_featured        32573 non-null int64
city_code                32573 non-null int64
region_code              32573 non-null int64
center_type              32573 non-null object
op_area                  32573 non-null float64
category                 32573 non-null object
cuisine                  32573 non-null object
dtypes: float64(3), int64(8), object(3)
memory usage: 3.7+ MB

In [42]:
test_data.to_csv('../data/test/test_feature.csv')

# Summary

1. There is nothing to clean in meal and fulfilment center information
2. In both, training and test dataset, some combination of week, center and meal are missing
3. There are outliers with respect to checkout_price and number of orders in training data
4. Merged meal and fulfilment center information with training and test data as part of pre-processing

### Outliers
<p>Action on outliers will be taken during the modeling based on the performance of model with and without outliers.</p>

### Missing Records
Missing records can be because to below two reasons:
1. There is actually no sales for that meal, center and weeks combination
2. Records were not captured due to technical error

Reason will become more clear after exploring data and then action can be taken.